'use strict';

const plants = {
    'home-plants': [
        {
            name: "Фікус (Ficus)",
            item_data:
                {
                    item_name: "Фікус (Ficus)",
                    description: "Фікус Еластика \"Belize\" (висота 30-40см) - це ряболистий сорт фікусу каучуконосного." +
                        "Головною відмінністю Беліза є його унікальне забарвлення. Так, у цього сорту на одній " +
                        "листовій пластині можна спостерігати - темно-зелений, блідо-зелений, біло-кремовий або світло-рожевий кольори." +
                        "Листя широкоовальної форми із загостреною верхівкою та притупленим кінцем, гладке, шкірясте," +
                        "глянсове, виростає в довжину до 23 сантиметрів і до 13 сантиметрів завширшки. Центральна" +
                        "жилка пурпурового відтінку, виражена з обох боків. Молоде листя, що ще не розпустилося," +
                        "огорнуте рожевими прилистками, до 18 сантиметрів у довжину. Фікус Беліз виглядає дуже" +
                        "екзотично, тому чудово підійде для будь-якої кімнати.",
                    image: "images/ficus.jpg",
                }
        },
        {
            name: "Фаленопсис (Falenopsis)",
            item_data:
                {
                    item_name: "Фаленопсис (Falenopsis)",
                    description: "Фаленопсис - найпоширеніша орхідея в кімнатному квітникарстві. Родом з вологих лісів" +
                        "Австралії, Південно-Східної Азії і Філіппін. Рід фаленопсисов налічує близько сімдесяти видів." +
                        "Квітка фаленопсис, який продається в квіткових магазинах, має неймовірну популярність не тільки" +
                        "завдяки своїй вишуканій і незвичайну красу, але ще й тому, що вирощування фаленопсис і його" +
                        "зміст не доставляє занепокоєння і не вимагає витрат." +
                        "Висота рослини з вазоном: 80см Діаметр вазона: 12см",
                    image: "images/falenipsis.jpg",
                }
        },
        {
            name: "Сансевієрія (Sansevieriia)",
            item_data:
                {
                    item_name: "Сансевієрія (Sansevieriia)",
                    description: "Сансевієрія Laurentii (Лауренті) висота 17*30 см - кімнатні рослини, що прекрасно ростуть" +
                        " практично в будь-яких умовах, якщо їх не перезволожувати. Найвідоміший сорт – Sansevieria " +
                        "trifasciata ‘Variegata’, іноді називається також ‘Laurentii’. Вона має жовті смуги, що йдуть зверху" +
                        " вниз по краях високого шаблевидного листя. При правильному догляді листя може досягати 1 м заввишки.",
                    image: "images/sansevieriia.jpg",
                }
        },
        {
            name: "Калатея (Calathea)",
            item_data:
                {
                    item_name: "Калатея (Calathea)",
                    description: "Калатея - це декоративна рослина із сімейства Марантові, яка стала популярною в країнах " +
                        "Східної Європи зовсім недавно. У перекладі з грецької назва рослини перекладається як \"кошик\". " +
                        "Раніше мешканці Бразилії використовували частини калатеї для плетіння кошиків. Сьогодні рослина " +
                        "культивується як декоративна, а не для виробничих потреб.",
                    image: "images/calathea.jpg",
                }
        },
        {
            name: "Заміокулькас (Zamioculcas)",
            item_data:
                {
                    item_name: "Заміокулькас (Zamioculcas)",
                    description: "Заміокулькас - монотипний рід рослин сімейства Ароїдні, представлений єдиним видом " +
                        "заміокулькас заміелистний, що походить з тропічної Африки. Назву отримав через схожість листя з " +
                        "листям замії. У народі у заміокулькаса є ще дві назви - «жіноче щастя» і «доларове дерево». Висота " +
                        "рослини 20-40 см.",
                    image: "images/zamiokulkas.jpg",
                }
        }
    ],
    'garden-plants': [
        {
            name: "Гортензія (Hydrangea)",
            item_data:
                {
                    item_name: "Гортензія (Hydrangea)",
                    description: "Мітільчата гортензія Vanille Fraise (Ваніла Фреіз) - з спокусливою назвою, не залишить " +
                        "байдужим нікого. Її суцвіття унікальні - до 30 см в довжину і близько 20 см в ширину, з плавним " +
                        "переходом від білого до малинового і багряного відтінку. Вони не строго конічні за формою, але " +
                        "пухнасті, як вата. Інтенсивність кольору залежить від місця розташування: на сонці квіти стають " +
                        "блідими і швидше відцвітають. Листки темно-зелені, овально-яйцеподібні. Період цвітіння - з кінця " +
                        "липня по вересень.",
                    image: "images/hydrangea.jpg",
                }
        },
        {
            name: "Жоржина (Dáhlia)",
            item_data:
                {
                    item_name: "Жоржина (Dáhlia)",
                    description: "Квіти жоржини (лат. Dahlia) родини айстрових - одні з найбільш красивих і " +
                        "довгоквітучих садових квітів, представлених найширшою палітрою забарвлень і розмаїттям форм. " +
                        "Цвітуть вони з липня аж до заморозків, і це найголовніша, крім краси, перевага жоржин. Перші " +
                        "бульби жоржини було привезено до Європи з Мексики в кінці XVIII ст. Ім'я своє рослина жоржина " +
                        "отримала в 1803 році від ботаніка Карла Вільденова, який назвав її на честь відомого ботаніка, " +
                        "етнографа і географа з Петербурга академіка Йоганна Георгі. Налічується близько тридцяти видів " +
                        "і близько 15000 сортів жоржин.",
                    image: "images/dahlia.jpg",
                }
        },
        {
            name: "Троянда (Rose)",
            item_data:
                {
                    item_name: "Троянда (Rose)",
                    description: "Троянда - королева саду. Ця рослина здавна вважалося об’єктом захоплення і поклоніння." +
                        " Не дарма саме її вибрали як символ кохання. Перші згадки про троянду можна зустріти ще в " +
                        "переказах стародавніх індусів. Легенди про прекрасні квіти зустрічаються і в літописах " +
                        "Стародавнього Ірану. За переказами чарівну білу Троянду з дуже гострими шипами створив сам " +
                        "Аллах. Вона повинна була стати володаркою квітів замість чудового, але вже дуже ледачого Лотоса." +
                        " Сьогодні ця рослина може стати справжньою окрасою вашого саду.",
                    image: "images/rose.jpg",
                }
        },
        {
            name: "Гібіскус (Hibiscus)",
            item_data:
                {
                    item_name: "Гібіскус (Hibiscus)",
                    description: "Білий гібіскус - одним з більш ніж 300 видів сімейства гибискусов, які виростають у " +
                        "всьому світі. Це гарний, міцний і простий у вирощуванні чагарник, повністю морозостійкий і " +
                        "нереально чарівний, коли його гілки усипані великими білими квітами. Квіти досить великі 10 см" +
                        " в діаметрі, трубчастої форми з 5 або більше пелюстками і червоним стовпом тичинок, що надає " +
                        "особливий акцент квітці. Цвітіння у гібіскуса починається з середини липня до останніх теплих " +
                        "і сонячних днів ранньої осені. Листя темно-зеленого кольору мають форму від овальних до " +
                        "ланцетних, часто з зубчастими або лопатевими краями.",
                    image: "images/hibiscus.jpg",
                }
        },
        {
            name: "Півонія (Paeonia)",
            item_data:
                {
                    item_name: "Півонія (Paeonia)",
                    description: "Півонія - це чудова рослина з густими, темно-зеленими листками та великими, махровими " +
                        "квітами. Вони мають діаметр до 15 см та ніжний рожевий колір з білими вкрапленнями. Ця рослина " +
                        "має дуже елегантний вигляд та додасть розкоші будь-якому саду.",
                    image: "images/peony.jpg",
                }
        },
    ],
    'fruits-trees': [
        {
            name: "Яблуня",
            item_data:
                {
                    item_name: "Яблуня",
                    description: "Яблуня Голден Делішес - популярний зимовий скороплідний сорт середньорослих дерев " +
                        "(до 3 м) з досить густий і гіллястою кроною у формі конуса. Стиглий плід з шорсткою, жовтого " +
                        "кольору шкіркою в зелену цятку досягає від 120 до 220 м Навіть зрілі плоди міцно тримаються " +
                        "на гілках. Вони солодкі на смак. Відноситься до десертних сортів. Вимагає запилення. " +
                        "При створенні певних умов для зростання яблуня дає високий урожай смачних плодів. Вони добре " +
                        "зберігаються і транспортуються. Вживаються як в свіжому вигляді, так і після кулінарної " +
                        "переробки.",
                    image: "images/apple.jpg",
                }
        },
        {
            name: "Груша",
            item_data:
                {
                    item_name: "Груша",
                    description: "Одна з найпопулярніших плодоносних садових груш - колоновидна Санремі. Ця крихітна " +
                        "красуня-груша виростає до 2,3 м у висоту, а всі її гілки спрямовані вгору, перебуваючи дуже " +
                        "близько до основного стовбура. Такий зовнішній вигляд дерева дозволяє створювати міні-сади " +
                        "навіть на найменших ділянках або поміщати рослину в декоративні горщики. Санремі - дерево " +
                        "плодоносяче. Зрілі жовті груші збирають в жовтні. Один плід, нагодований сонцем і дощами, " +
                        "важить близько 400 г. За хорошого догляду і сонячного місця груша дарує до 15 кг врожаю щороку.",
                    image: "images/grusha.jpg",
                }
        },
        {
            name: "Абрикос",
            item_data:
                {
                    item_name: "Абрикос",
                    description: "Колоноподібний абрикос - гарний садовий представник з річною родючістю. Сорт Принц " +
                        "березня примхливе, але щедре дерево. Зовнішній вигляд" +
                        "Абрикос Принц березня відноситься до Колоноподібних плодових дерев. Тому його висота рідко " +
                        "перевищує 1,5 метра, а ширина міцного стовбура з тонкою сірою корою -5 м. Листя розташоване " +
                        "поблизу стовбура, створюючи м'яку подушку для східчасто розташованих плодів. Абрикоси кулясті," +
                        " оксамитові, сонячні. деревьям. Поэтому его высота редко превышает 1,5 метра, а ширина крепкого " +
                        "ствола с тонкой серой корой —5 м. Листья расположены вблизи ствола, создавая мягкую подушку для" +
                        " ступенчато расположенных плодов. Абрикосы шаровидные, бархатистые, солнечные. ",
                    image:
                        "images/apricot.jpg",
                }
        },
        {
            name: "Вишня",
            item_data:
                {
                    item_name: "Вишня",
                    description: "Рання вишня - може володіти унікальними видом і розміром. Сорт Восторг за 10 років " +
                        "виростає лише до 1,5-2 м у висоту. Однак це не єдина його особливість. Колоновидний сорт " +
                        "виключає появу на дереві розлогих гілок і збирає лише невеликі відгалуження якомога ближче " +
                        "до стовбура, направляючи їх вгору. Краса дерева підкреслюється криваво-червоними ягодами по " +
                        "10-15 г. Насолоджуватися соковитими і м'ясистими ягодами можна вже в середині липня. " +
                        "М'якоть легко відділяється від кісточки і дарує кислувато-солодкий смак.",
                    image:
                        "images/cherry.jpg",
                }
        },
        {
            name: "Слива",
            item_data:
                {
                    item_name: "Слива",
                    description: "Саджанець сливи Командор - обов'язково приживеться в саду, на присадибній ділянці, в " +
                        "палісаднику або на дачі. Адже красиве Колоноподібне деревце виведене в Україні та звикло до " +
                        "зміни погоди та холодних зим. Командор - дерево декоративне, відмінно виглядає на будь-якій " +
                        "території. Світлий стовбур невеликого діаметра (3-5 см), з середини та до верхівки покритий " +
                        "звичним зеленим листям. Колоноподібний сорт, так само як і звичайні види слив, має " +
                        "кругло-витягнуте листя, пофарбоване в зелений колір. Контрастом на тлі глянсового листя " +
                        "виступають плоди фіолетово-червоного відтінку. Сливи еліпсоїдної форми, покриті щільною " +
                        "матовою шкіркою.",
                    image:
                        "images/plum.jpg",
                }
        },
    ]
}
const buttonOrder = document.querySelector('.buy-btn');
const buttonConfirmation = document.querySelector('.button-order-confirmation');
const orders = document.querySelector('.orders-description');
const items = document.querySelector('.items');
const header = document.querySelector('.header');

const itemMenu = document.querySelector('.item-menu');
itemMenu.onclick = (e) => {
    const getAttribute = e.target.getAttribute('item-attribute');
    const div = document.querySelector('.item-product');

    div.childNodes.forEach((node) => {
        node.remove();
    });

    const ul = document.createElement('ul');
    let items = plants[getAttribute];
    items.forEach((item) => {
        const li = document.createElement('li');
        li.innerHTML = item.name;
        li.setAttribute('item-name', getAttribute);
        li.addEventListener('click', (ev) => {
            const divDescription = document.querySelector('.item-product-info');
            divDescription.hidden = false;
            const imagesDescription = divDescription.querySelector('img');
            const index = ev.target.getAttribute('item-name');
            const elementData = findElementData(plants[index], ev.target.innerHTML);
            imagesDescription.src = elementData.item_data.image;
            const descriptionProduct = findElementInDiv(divDescription, '.description');
            const titleDescription = highlightingTitleDescription(elementData.item_data.description);
            const descriptionText = descriptionProduct.querySelector('p');
            const title = descriptionProduct.querySelector('h3');
            title.innerHTML = elementData.item_data.item_name;
            descriptionText.innerHTML = `<span> ${titleDescription[0]}</span> - ` + titleDescription[1];
            findElementInDiv(divDescription, '.description').appendChild(title);
            findElementInDiv(divDescription, '.description').appendChild(descriptionText);
        })
        ul.appendChild(li);
    });
    div.appendChild(ul);
};

const findElementInDiv = (div, el) => {
    return div.querySelector(el)
};

const highlightingTitleDescription = (description) => {
    return description.match(/(.*?) - (.*)/).slice(1, 3);

};

const findElementData = (data, itemName) => {
    return data.find((dataItem) => {
        return dataItem.name === itemName
    });
};

buttonOrder.addEventListener('click', () => {
    orders.style.display = "inline";
    header.style.marginBottom = "40px";
    items.style.display = "none";
});


buttonConfirmation.addEventListener('click', () => {
    alert('Замовлення оформленно, дякую за покупку!');
    window.location.reload();
})